      ******************************************************************
      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. sub-cls AS "cls".
      ******************************************************************
      *
       ENVIRONMENT DIVISION.
      ******************************************************************
      *
       DATA DIVISION.
      ******************************************************************
      *
       PROCEDURE DIVISION.
            CALL "SYSTEM" USING "clear".
            EXIT PROGRAM.
       END PROGRAM sub-cls.
